<?php

/*
   +----------------------------------------------------------------------+
   |                  			  xy platform                    	  	  |
   +----------------------------------------------------------------------+
   | Copyright (c) 2014 http://www.xiaoy.name   All rights reserved.      |
   +----------------------------------------------------------------------+
   | 全局文案相关配置      									      	 	  	  |
   +----------------------------------------------------------------------+
   | Authors: xiaoy <zs1379@vip.qq.com>       CreateTime:2014-11-15       |
   +----------------------------------------------------------------------+
*/

return array(
    //以下为举例，建议大家以业务或者文件来分段，英文起名尽量以描述清楚为主，因为主要用于我们自身排查bug。

    //全局配置--各中心必须保留并且更换编号
    'system_index'      => 9,    //应用系统编号，用于防止验证冲突，每个中心一个编号
    'system_error'      => '系统出错，请骚后再试～(错误码：91001)',
    'param_not_true'    => '发生点小意外，请重试一下～(错误码:91004)',
    'auth_failed'       => '发生点小意外，请重试一下～(错误码:91005)',
    'auth_key_used'     => '发生点小意外，请重试一下～(错误码:91006)',
    'auth_timeout'      => '发生点小意外，请重试一下～(错误码:91007)',
    'may_be_attack'     => '您的输入包含非法字符，请修改后重试，谢谢～(错误码:91008)',

    //注册登陆
    'register_name_used' => '用户名已使用，请更换～'
);