<?php
/*
   +----------------------------------------------------------------------+
   |                  			  xy framework                    	  	  |
   +----------------------------------------------------------------------+
   | Copyright (c) 2013 http://www.xiaoy.name   All rights reserved.      |
   +----------------------------------------------------------------------+
   | xy框架的单点扩展基础类								      	 	  	      |
   +----------------------------------------------------------------------+
   | Authors: xiaoy <zs1379@vip.qq.com>       CreateTime:2014-08-26       |
   +----------------------------------------------------------------------+
*/

abstract class XySinglePoint {

	/**
	 * 所有扩展都必须实现此方法，该方法将会自动调用
	 */
	function doing(){
		
	}
	
	/**
	 * 魔术方法，设置参数值
	 */
	public function __set($key, $value)
	{
		$this->$key = $value;
	}
	
	/**
	 * 魔术方法，取得参数值
	 */
	public function __get($key)
	{
		return $this->$key;
	}
}